Revit 2026 API

# AssemblyInstanceIsMember Method

---

Determines whether the given ElementId is a member of this assembly

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsMember(
	ElementId id
)
```
```vb
Public Function IsMember (
	id As ElementId
) As Boolean
```
```cpp
public:
bool IsMember(
	ElementId^ id
)
```
```fsharp
member IsMember :
        id : ElementId -> bool
```

#### Parameters

id ElementId

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace